tap "homebrew/dupes"
tap "homebrew/versions"
tap "caskroom/cask"

brew "vim", args: ["--with-lua"]
brew "macvim"

brew "zsh"

brew "git"
brew "mercurial"
brew "htop"
brew "midnight-commander"
brew "heroku"

brew "chruby"
brew "ruby-install"

brew "elixir"

brew "memcached"
brew "mysql"
brew "postgresql"
brew "redis"
brew "sqlite"

brew "openssl"
brew "openssh"

brew "node"
brew "qt55"

brew "ack"
brew "grep", args: ["--with-default-names"]
brew "the_silver_searcher"
brew "tree"
brew "unrar"
brew "watch"
brew "wget"

brew "imagemagick"
brew "optipng"
brew "jpegoptim"
brew "ffmpeg", args: ["--with-faac", "--with-fdk-aac", "--with-ffplay", "--with-fontconfig", "--with-freetype", "--with-frei0r", "--with-libass", "--with-libbs2b", "--with-libcaca", "--with-libquvi", "--with-libsoxr", "--with-libssh", "--with-libvidstab", "--with-libvorbis", "--with-libvpx", "--with-opencore-amr", "--with-openjpeg", "--with-openssl", "--with-opus", "--with-rtmpdump", "--with-schroedinger", "--with-speex", "--with-theora", "--with-tools", "--with-webp", "--with-x265", "--with-zeromq"]
brew "youtube-dl"
brew "flac"

brew "gpg"

cask "alfred"
cask "caffeine"
cask "dash"
cask "daisydisk"
cask "etcher"
cask "firefox"
cask "flux"
cask "fork"
cask "google-chrome"
cask "hammerspoon"
cask "iterm2"
cask "keybase"
cask "keyboard-cleaner"
cask "libreoffice"
cask "little-snitch"
cask "mactracker"
cask "micro-snitch"
cask "numi"
cask "onyx"
cask "opera"
cask "rocket"
cask "rowanj-gitx"
cask "sequel-pro"
cask "slack"
cask "telegram"
cask "the-unarchiver"
cask "vlc"
cask "whatsapp"
cask "xld"
