brew "gcc"

brew "vim"

brew "zsh"

brew "git"
brew "tig"
brew "mercurial"
brew "htop"
brew "midnight-commander"

brew "chruby"
brew "ruby-install"
brew "asdf"
brew "elixir"

brew "memcached"
brew "redis"
brew "sqlite"

brew "openssl"
brew "openssh"

brew "node"
brew "yarn"

brew "ack"
brew "autojump"
brew "bat"
brew "the_silver_searcher"
brew "tree"
brew "watch"
brew "wget"

brew "imagemagick"
brew "optipng"
brew "jpegoptim"
brew "ffmpeg"
brew "youtube-dl"
brew "flac"
brew "par2"

brew "gpg"

